Repository: mofaragattia-hub/time_boxing
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Timeboxing
ar: تيمبوكسينج

source: Hello!
ar: أهلاً!

# welcome
source: Welcome to Timeboxing
ar: مرحباً بك في تيمبوكسينج

source: Delete Selected Tasks
ar: حذف المهام المحددة

# deleteTasksConfirmation
source: Are you sure you want to delete {count} tasks?
ar: هل أنت متأكد من حذف {count} مهام؟

source: Delete
ar: حذف

source: Cancel
ar: إلغاء

# tipsAndInsights
source: Tips & Insights
ar: نصائح وإرشادات

source: Daily Tip
ar: نصيحة اليوم

source: Productivity Insights
ar: رؤى الإنتاجية

source: Time Management Tips
ar: نصائح إدارة الوقت

source: Learning Resources
ar: موارد التعلم

source: Tip of the Day
ar: نصيحة اليوم

source: View All Tips
ar: عرض جميع النصائح

# noInsightsYet
source: Complete more tasks to see insights!
ar: أكمل المزيد من المهام لرؤية الإرشادات!

# keepGoing
source: Keep going! You're doing great.
ar: استمر! أنت تقوم بعمل رائع.

# tip1Title
source: The Two-Minute Rule
ar: قاعدة الدقيقتين

# tip1Description
source: If a task takes less than two minutes, do it immediately. This prevents small tasks from piling up.
ar: إذا كانت المهمة تستغرق أقل من دقيقتين، قم بها فوراً. هذا يمنع تراكم المهام الصغيرة.

# tip2Title
source: Time Blocking
ar: تقسيم الوقت

# tip2Description
source: Dedicate specific time blocks to different tasks. This helps maintain focus and reduces context switching.
ar: خصص فترات زمنية محددة لمهام مختلفة. هذا يساعد في الحفاظ على التركيز وتقليل التشتت.

# tip3Title
source: Eat the Frog
ar: ابدأ بالأصعب

# tip3Description
source: Start your day with the most challenging task. Once it's done, everything else feels easier.
ar: ابدأ يومك بالمهمة الأكثر تحدياً. بمجرد إنجازها، سيبدو كل شيء آخر أسهل.

# tip4Title
source: Pomodoro Technique
ar: تقنية بومودورو

# tip4Description
source: Work in 25-minute focused sessions followed by 5-minute breaks. This maintains high productivity.
ar: اعمل في جلسات مركزة مدتها 25 دقيقة تليها فترات راحة 5 دقائق. هذا يحافظ على إنتاجية عالية.

# tip5Title
source: Batch Similar Tasks
ar: جمع المهام المتشابهة

# tip5Description
source: Group similar tasks together and complete them in one session to improve efficiency.
ar: اجمع المهام المتشابهة معاً وأكملها في جلسة واحدة لتحسين الكفاءة.

# tip6Title
source: Set Clear Goals
ar: حدد أهدافاً واضحة

# tip6Description
source: Define specific, measurable goals for each task. Clarity leads to better execution.
ar: حدد أهدافاً محددة وقابلة للقياس لكل مهمة. الوضوح يؤدي إلى تنفيذ أفضل.

# tip7Title
source: Eliminate Distractions
ar: تخلص من المشتتات

# tip7Description
source: Turn off notifications and create a focused work environment during task execution.
ar: أوقف الإشعارات وأنشئ بيئة عمل مركزة أثناء تنفيذ المهام.

# tip8Title
source: Review and Reflect
ar: راجع وتأمل

# tip8Description
source: Spend 10 minutes at the end of each day reviewing what you accomplished and planning tomorrow.
ar: اقضِ 10 دقائق في نهاية كل يوم لمراجعة ما أنجزته والتخطيط للغد.

# tip9Title
source: The 80/20 Rule
ar: قاعدة 80/20

# tip9Description
source: Focus on the 20% of tasks that will generate 80% of your results. Prioritize wisely.
ar: ركز على 20% من المهام التي ستحقق 80% من نتائجك. رتب أولوياتك بحكمة.

# tip10Title
source: Take Regular Breaks
ar: خذ فترات راحة منتظمة

# tip10Description
source: Short breaks improve focus and prevent burnout. Your brain needs rest to perform optimally.
ar: فترات الراحة القصيرة تحسن التركيز وتمنع الإرهاق. عقلك يحتاج للراحة للأداء الأمثل.

# tip11Title
source: Single-Tasking
ar: التركيز على مهمة واحدة

# tip11Description
source: Focus on one task at a time. Multitasking reduces quality and increases completion time.
ar: ركز على مهمة واحدة في كل مرة. تعدد المهام يقلل الجودة ويزيد وقت الإنجاز.

# tip12Title
source: Plan Tomorrow Today
ar: خطط للغد اليوم

# tip12Description
source: Spend 5 minutes before bed planning tomorrow's tasks. You'll wake up with clarity and purpose.
ar: اقضِ 5 دقائق قبل النوم في التخطيط لمهام الغد. ستستيقظ بوضوح وهدف.

# insight1
source: You're most productive on {day}. Schedule important tasks on this day!
ar: أنت أكثر إنتاجية يوم {day}. جدول المهام المهمة في هذا اليوم!

# insight2
source: Your average task completion rate is {rate}%. Keep up the good work!
ar: متوسط معدل إنجاز مهامك هو {rate}%. استمر في العمل الجيد!

# insight3
source: You've completed {count} tasks this week. That's impressive!
ar: لقد أكملت {count} مهمة هذا الأسبوع. هذا رائع!

# insight4
source: Try breaking larger tasks into smaller chunks for better completion rates.
ar: حاول تقسيم المهام الكبيرة إلى أجزاء أصغر لمعدلات إنجاز أفضل.

# insight5
source: You work best in {duration}-minute sessions. Use this to your advantage!
ar: تعمل بشكل أفضل في جلسات مدتها {duration} دقيقة. استخدم هذا لصالحك!
